Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/attributes/messages.*.xlf
Languages: fr, id, sr, zh

source: Manage attributes
fr: Attributs
id: Kelola atribut
sr: Уређивање својстава
zh: 管理属性

source: Attributes
fr: Attributs
id: Atribut
sr: својства
zh: 属性

# add.a.attribute
source: Create an attribute
fr: Créer un attribut
id: Buat sebuah atribut
sr: Креирај својство
zh: 创建一个属性

# attributes.form.code
source: Code
fr: Code d'attribut
id: Kode
sr: Код својства
zh: 代码

# attributes.form.type
source: Attribute type
fr: Type de l'attribut
id: Jenis atribut
sr: Тип својства
zh: 属性类型

# attributes.form.attributeTranslations
source: Translations
fr: Traductions
id: Terjemahan
sr: Преводи
zh: 翻译

# attributes.form.options
source: Available options (for choice type)
fr: Options (pour le type «Choix»)
id: Opsi yang tersisa (untuk jenis pilihan)
sr: Доступне опције (за тип)
zh: 可用的选项（选择类型）

source: Back to attributes
fr: Retour aux attributs
id: Kembali ke atrinut
sr: Назад на својства
zh: 回到属性

# attributes.form.type.string
source: Basic text string
fr: Chaîne de caractères
id: String teks dasar
sr: Низ карактера
zh: 基本文字字符串

# attributes.form.type.datetime
source: Date and time
fr: Date et heure
id: Tanggal dan waktu
sr: Датум и време
zh: 日期与时间

# attributes.form.type.boolean
source: Boolean (true of false)
fr: Booléen (vrai ou faux)
id: Boolean (benar atau salah)
sr: Логичко (да или не)
zh: 布尔值（是 或 否）

# attributes.form.type.integer
source: Integer number
fr: Nombre entier
id: Nomor integer
sr: Цео број
zh: 整数

# attributes.form.type.decimal
source: Decimal number
fr: Nombre décimal
id: Nomor desimal
sr: Децимални број
zh: 小数

# attributes.form.type.percent
source: Percent
fr: Pourcentage
id: Persen
zh: 百分比

# attributes.form.type.email
source: Single email address
fr: Adresse email unique
id: Alamat email tunggal
sr: Јединствена email адреса
zh: 单个电子邮件地址

# attributes.form.type.colour
source: Hexadecimal colour
fr: Couleur hexadécimale
id: Warna heksadesimal
sr: Боја, хексадецимално
zh: 十六进制颜色

# attributes.form.type.enum
source: Single choice
fr: Choix simple
id: Pilihan tunggal
sr: Јединствени избор
zh: 单个选择

# attributes.form.type.country
source: Country code
fr: Code pays
id: Kode negara
sr: Код државе
zh: 国家及地区代码

# node.attributes
source: Attributes
fr: Attributs
id: Atrinut
sr: Својства
zh: 属性

# attribute_values.form.attribute
source: Add a new attribute
fr: Ajouter un nouvel attribut
id: Tambah sebuah atribut baru
sr: Додај ново својство
zh: 添加一个新属性

# new_attribute
source: -- Choose an attribute --
fr: -- Choisir un attribut --
id: -- Pilih sebuah atribut --
sr: -- Одаберите својство --
zh: -- 选择一个属性 --

# add.a.node.attribute
source: Add attribute to current node
fr: Ajouter l'attribut au nœud
id: Tambah atribut ke node saat ini
sr: Доделите својство постојећем чвору
zh: 添加属性到现有代码

# attributes.no_value
source: -- No value --
fr: -- Aucune valeur --
id: -- Tidak ada nilai --
sr: -- Нема задате вредности --
zh: -- 没有值 --

# attribute.%name%.created
source: Attribute %name% was created
fr: L'attribut %name% a été créé.
id: Atribut %name% telah dibuat
sr: Својство %name% је креирано
zh: 属性 %name% 已创建

# attribute.%name%.updated
source: Attribute %name% was updated
fr: L'attribut %name% a été mis à jour.
id: Atribut %name% telah diperbarui
sr: Својство %name% је ажурирано
zh: 属性 %name% 已更新

# attribute.%name%.deleted
source: Attribute %name% was deleted
fr: L'attribut %name% a été supprimé.
id: Atribut %name% telah dihapus
sr: Својство %name% је избрисано
zh: 属性 %name% 已删除

# attributes.value
source: Value
fr: Valeur
id: Nilai
sr: Вредност
zh: 值

# attributes.group
source: Group
fr: Groupe
id: Grup
zh: 群组

# are_you_sure.delete.attribute
source: Are you sure you want to delete this attribute?
fr: Êtes-vous sûr·e de vouloir supprimer cet attribut ?
id: Apakah Anda yakin ingin menghapus atribut ini?
sr: Да ли сте сигурни да желите да избришете ово својство?
zh: 您确定要删除此属性吗？

# attribute.%name%.deleted_from_node.%nodeName%
source: Attribute %name% was deleted from %nodeName% node
fr: L'attribut %name% a été supprimé du nœud %nodeName%.
id: Atribut %name% telah dihapus dari node %nodeName%
sr: Својство %name% је избрисано из чвора %nodeName%
zh: 属性 %name% 已从节点 %nodeName% 中删除

source: Delete attribute %name%
fr: Supprimer l'attribut %name%
id: Hapus atribut %name%
sr: Избриши својство %name%
zh: 删除属性 %name%

# attribute_value_translation.%name%.updated_from_node.%nodeName%
source: Attribute %name%'s value has been updated for node-source %nodeName%.
fr: La valeur de l'attribut %name% a été mis à jour pour le nœud %nodeName%.
id: Nilai atribut %name% tlah diperbarui dari sumber-node %nodeName%.
sr: Вредност својства %name% за чвор %nodeName% је ажурирана.
zh: 节点源 %nodeName% 的属性 %name% 的值已更新。

# attribute_code.must_contain_alpha_underscore
source: Attribute code must only contain alphabetical characters including underscore.
fr: Un code d'attribut ne doit contenir seulement des lettres et le caractère tiret-bas.
id: Kode atribut harus berisi hanya karakter alphabet termasuk garis bawah.
sr: Код атрибута може садржати само алфабетске знакове, укључујући и доњу црту.
zh: 属性代码应只包含字母及下划线。

# attributes.form.searchable
source: Indexed in search-engine?
fr: Indexé dans le moteur de recherche ?
id: Diindeks dalam mesin-pencari?
sr: Индексирaнo у енџин за претраживање?
zh: 在搜索引擎中索引？

# attributes.form_help.searchable
source: Index current attribute values in your full-text search-engine for each translation.
fr: Indexe la valeur de l'attribut dans le moteur de recherche plein-texte.
id: Indeks nilai atribut saat ini dalam mesin-pencari teks-penuh untuk setiap terjemahan.
sr: Индексирај тренутне вредности атрибута, у енџин за претраживање, за сваки превод.
zh: 在全文搜索引擎中，为每个翻译索引目前的属性值。

# attributes.form_help.code
source: Code allows attribute name to be unique all over your website translations.
fr: Le code d'attribut permet de l'identifier de manière unique et ce pour toutes les traductions de votre site.
id: Kode mengizinkan nama atribut untuk menjadi unik di seluruh terjemahan situs web Anda.
sr: Код дозвољава да име атрибута буде јединствено, на целом веб-сајту, за све преводе.
zh: 代码能让属性名在您的网站翻译中是唯一的。

# attributes.import_form.file.label
source: Import attributes file
fr: Importer un fichier d’attributs
id: Impor berkas atribut
zh: 导入属性文件

# attributes.import_form.file.help
source: Attributes file must be a valid JSON file with Roadiz attributes structure.
fr: Le fichier d’attributs doit être un fichier au format JSON valide respectant la structure des attributs Roadiz.
id: Berkas atribut haruslah berupa sebuah bekas JSON yang valid dengan struktur atribut Roadiz.
zh: 属性文件必须是包含 Roadiz 属性结构的有效 JSON 文件。

# attributes.form.group
source: Group
fr: Groupe
id: Grup
zh: 群组

# attributes.form_help.group
source: Groups allow developer to gather attributes in same place for public display.
fr: Permet de rassembler les attributs au sein de groupes pour l’affichage publique.
id: Grup mengizinkan pengembang untuk mengizinkan mengumpulkan atribut dalam tempat yang sama untuk tampilan publik.
zh: 群组能让开发者在同一个位置收集属性以公开展示。

# attributes.form.color
source: Color
fr: Couleur
id: Warna
zh: 颜色

# attributes.form_help.color
source: Attribute color that may be used on public display.
fr: Couleur de l’attribut pouvant être affichée publiquement.
id: Warna atribut yang mungkin digunakan pada tampilan publik.
zh: 可能公开展示的属性颜色

# attributes.form_help.documents
source: Documents that may illustrate current attribute on public display.
fr: Documents illustrant l’attribut pour son affichage public.
id: Dokumen yang mungkin menggambarkan atribut saat ini pada tampilan publik.
zh: 可能会公开展示的说明现有属性的文档

# attributes.form.group.placeholder
source: -- No group --
fr: -- Aucun groupe --
id: -- Tidak ada grup --
zh: -- 没有群组 --

source: Back to attribute groups
fr: Retour aux groupes d’attributs
id: Kembali ke grup atribut
zh: 回到属性组

# add.a.attribute_group
source: Create an attribute group
fr: Créer un groupe d’attributs
id: Buat sebuah grup atribut
zh: 创建一个属性组

source: Attribute groups
fr: Groupes d’attributs
id: Grup atribut
zh: 属性组

# attribute_groups.name
source: Group name
fr: Nom du groupe
id: Nama grup
zh: 群组名

# attribute_group.form.name
source: Group name
fr: Nom du groupe
id: Nama grup
zh: 群组名

# attribute_group.%name%.created
source: %name% attribute group was created
fr: Le groupe %name% a bien été créé
id: Grup atribut %name% telah dibuat
zh: %name% 属性组已创建

# attribute_group.%name%.updated
source: %name% attribute group was updated
fr: Le groupe %name% a bien été mis à jour
id: Grup atribut %name% telah diperbarui
zh: %name% 属性组已更新

# attribute_group.%name%.deleted
source: %name% attribute group was deleted
fr: Le groupe %name% a bien été supprimé
id: Grup atribut %name% telah dihapus
zh: %name% 属性组已删除

# delete.attribute_group.%name%
source: Delete %name% attribute group
fr: Supprimer le groupe d’attribut %name%
id: Hapus grup atribut %name%
zh: 删除 %name% 属性组

# are_you_sure.delete.attribute_group
source: Are you sure you want to delete this attribute group?
fr: Êtes-vous sûr·e de vouloir supprimer le groupe d'attributs ?
id: Apakah Anda yakin ingin menghapus grup atribut ini?
zh: 您确定要删除此属性组吗？

# attribute_group.form.canonicalName
source: Canonical name
fr: Nom canonique
id: Nama kanonikal
zh: 规范名称

# attribute_group.form.attributeGroupTranslations
source: Group translations
fr: Traductions du groupe
id: Terjemahan grup
zh: 群组翻译

# attributes.reset_value
source: Reset attribute value to default language
fr: Réinitialiser la valeur à celle de la langue principale
id: Hapus nilai atribut ke bahasa bawaan
zh: 重置属性值为默认语言

# attribute.%name%.reset_for_node.%nodeName%
source: %name% attribute has been reset for node %nodeName%.
fr: L'attribut %name% a été réinitialisé pour le nœud %nodeName%.
id: %name% atribut telah di atur ulang/reset untuk node %nodeName%.
zh: 节点 %nodeName% 的属性 %name% 已被重置。

# attributes.delete_value
source: Delete attribute value for this node
fr: Supprimer la valeur pour ce nœud
id: Hapus nilai atribut untuk node ini
zh: 删除此节点的属性值

# are_you_sure.delete_value.attribute
source: Are you sure you want to delete this attribute value for this node?
fr: Êtes-vous sûr·e de vouloir supprimer la valeur de cet attribut pour ce nœud ?
id: Apakah Anda yakin ingin menghapus nilai atribut ini untuk node ini?
zh: 您确定要删除此节点的属性值吗？

# delete.attribute.%name%.for_node.%nodeName%
source: Delete %name% attribute for %nodeName% node
fr: Supprimer l’attribut «%name%» pour le nœud «%nodeName%»
id: Hapus %name% atribut untuk node %nodeName%
zh: 删除节点 %nodeName% 的 %name% 属性。

# reset.attribute.%name%
source: Reset %name% attribute value
fr: Réinitialiser la valeur de l’attribut %name%
id: Atur ulang nilai atribut %name%
zh: 重置 %name% 属性值

# reset.attribute.%name%.for_node.%nodeName%
source: Reset %name% attribute value for %nodeName% node
fr: Réinitialiser la valeur de l’attribut «%name%» pour le nœud «%nodeName%»
id: Atur ulang nilai %name% atribut untuk node %nodeName%
zh: 重置 %nodeName% 节点的 %name% 属性值

# are_you_sure.reset.attribute_value
source: Are you sure you want to reset attribute value for this language?
fr: Êtes-vous sûr·e de vouloir réinitialiser la valeur de l'attribut pour cette langue ?
id: Apakah Anda yakin ingin mengatur ulang/reset nilai atribut untuk bahasa ini?
zh: 您确定要重置此语言的属性值吗？

# attribute_value.%attributeValueId%.not_exists
source: Attribute %attributeValueId% value does not exist
fr: La valeur de l’attribut %attributeValueId% n’existe pas
id: Nilai atribut %attributeValueId% tidak ada/tersedia
zh: 属性 %attributeValueId% 的值不存在

# attributes.usage
source: Usage count
fr: Nombre d'utilisations

# attributes.weight
source: Weight
fr: Poids

# attributes.form_help.weight
source: Absolute weight to sort attribute in filtered lists.
fr: Poids absolu pour faciliter le tri des listes d'attributs filtrées.

# attributes.code
source: Code
id: Kode
sr: Код
zh: 代码

# attributes.form.type.date
source: Date
id: Tanggal
sr: Датум
zh: 日期

# attributes.form.documents
source: Documents
id: Dokumen
zh: 文档
