Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/settings/messages.*.xlf
Languages: fr, zh

# force_locale.description
source: Force displaying translation locale in every node’ paths. This should be ON if you redirect users based on their language on homepage.
fr: Forcer l'affichage de la locale de traduction dans les chemins de chaque noeud, même pour la langue par défaut. Cela devrait être activé si vous redirigez les utilisateurs en fonction de leur langue sur la page d'accueil.
zh: 强制在每个节点的路径中显示翻译本地化。如果您在首页基于他们的语言重定向用户，这应该要开启。

# email_sender.description
source: Default sender email, used as origin for every system email sent. This email **must be allowed by your SMTP server.**
fr: Email d'expéditeur par défaut, utilisé comme Origine pour chaque email système envoyé. Cet email **doit être autorisé par votre serveur SMTP.**
zh: 默认电子邮件发送者，作为所有系统邮件的发送来源。此电子邮件 **必须被您的 SMTP 服务器允许**。

# leaflet_map_tile_url.description
source: Default maps tiles layout when using *Leaflet*.
fr: Habillage par défaut des cartes lorsque vous utilisez *Leaflet*.
zh: 当使用 *Leaflet* 时的默认地图图层布局。

# login_image.description
source: Replace random *Splashbase* login images with your own.
fr: Remplace les images aléatoires *Splashbase* avec votre propre image d’arrière-plan.
zh: 用您自己的图片替换 *Splashbase* 的随机登录图片。

# maintenance_mode.description
source: Switch maintenance mode. Only login page will be available for public requests.
fr: Active/désactive le mode maintenance. Seulement les pages d'identification seront disponibles pour les requêtes publiques.
zh: 切换维护模式。只有登录页面会回应公开请求。

# maps_default_location.description
source: Default maps marker location.
fr: Emplacement par défaut sur les cartes.
zh: 默认地图标记位置。

# maps_style.description
source: Default maps tiles layout when using *Google Maps*.
fr: Habillage par défaut des cartes lorsque vous utilisez *Google Maps*.
zh: 当使用 *Google Maps* 时的默认地图图层布局。

# max_versions_showed.description
source: Maximum versions count showed in actions menu.
fr: Nombre maximum de versions affichées dans le menu des actions.
zh: 操作菜单中显示的最大版本数计数。

source: hide_roadiz_version.help
fr: Cache le numéro et le nom du CMS des en-têtes HTTP et des variables du thème.
zh: 在回应头及主题变量中隐藏 Roadiz 版本和名称。

source: force_locale_with_urlaliases
fr: Afficher la locale avec les alias d’URL
zh: 使用网址别名时显示区域代码

source: force_locale_with_urlaliases.help
fr: La locale sera toujours affichée dans le chemin généré pour une source de nœud même si elle possède un alias d’URL dans la langue demandée.
zh: 这将在节点源路径中强制显示区域代码，即使网址别名已经存在。

source: use_native_json
fr: Utiliser le format JSON natif
zh: 使用原生 JSON 字段类型

# use_native_json.help
source: Use MySQL 5.7+ JSON field type.
fr: Utiliser le type de champ JSON MySQL disponible à partir de la version 5.7.
zh: 使用 MySQL 5.7+ JSON 字段类型

source: oauth_client_id
fr: OAuth2 Client ID
zh: OAuth2 Client ID

source: oauth_client_id.help
fr: Identifiant à récupérer depuis votre fournisseur d’identité OpenID (OAuth2).
zh: 粘贴从您的 OpenID 身份验证提供者(OAuth2)取得的 Client ID

source: oauth_client_secret
fr: OAuth2 Client secret
zh: OAuth2 Client secret

source: oauth_client_secret.help
fr: Secret à récupérer depuis votre fournisseur d’identité OpenID (OAuth2).
zh: 粘贴从您的 OpenID 身份验证提供者(OAuth2)取得的密钥

source: openid_hd
fr: Restreindre au nom de domaine
zh: 限制为域名

source: openid_hd.help
fr: Autorise seulement les emails du nom de domaine à s’authentifier avec OpenID.

source: openid_button_label
fr: Label du bouton de connexion OpenID
zh: 与 OpenID 按钮标签连接

source: openid_button_label.help
fr: Personnaliser le label du bouton sur la page de connexion au back-office.

source: openid_discovery
fr: URL d’auto-découverte OpenID
zh: 自动发现 OpenID URL

source: openid_discovery.help
fr: Lien standard d’auto-découverte OpenID, nécessaire à l’activation de la fonctionnalité OpenID dans Roadiz.

source: openid_default_roles
fr: Rôles attribués automatiquement au domaine OpenID

source: openid_default_roles.help
fr: Lister les rôles, séparés par virgule, à attribuer automatiquement aux utilisateurs authentifiés via OpenID.

source: openid_scopes
fr: Scopes Open ID / OAuth2

source: openid_scopes.help
fr: Réduit la liste des scopes demandés. Lister les scopes séparés par un espace. Si la liste est laissée vide, OpenID tentera de se connecter avec tous les scopes disponibles depuis le document d’auto-découverte.

source: custom_preview_scheme
fr: Système d'URL de prévisualisation personnalisé
zh: 自定义预览格式

source: custom_preview_scheme.help
fr: Remplace la query-string "?preview=1" des URL de prévisualisation par un nom de domaine personnalisé. Cela peut être utile avec la version *Headless* de Roadiz.

source: custom_public_scheme
fr: Système d'URL public personnalisé
zh: 自定义公开格式

source: custom_public_scheme.help
fr: Remplace les URL publics de votre site web avec un nom de domaine personnalisé. Cela peut être utile avec la version *Headless* de Roadiz.

source: use_typed_node_names
fr: Utiliser des noms de nœuds typés
zh: 使用已输入的节点名称

source: use_typed_node_names.help
fr: Une fois activée, cette option suffixera chaque nom des nœuds non-atteignables (blocs) avec leur type pour éviter les conflits de nom avec les nœud atteignables (pages).

source: openid_username_claim
fr: Claim du nom d’utilisateur Open ID
zh: 声明 OpenID 用户名

source: openid_username_claim.help
fr: Si vide, Roadiz utilisera le claim “email” comme nom d’utilisateur Open ID

source: APIs
fr: API
zh: API

source: Development
fr: Développement
zh: 开发

source: Emailings
fr: Envoi d'e-mails
zh: 电子邮件

source: Site informations
fr: Informations du site
zh: 站点信息

source: Site information
fr: Informations du site
zh: 站点信息

source: Social networks
fr: Réseaux sociaux
zh: 社交网络

source: dashboard_iframe
fr: Iframe personnalisée pour le Dashboard
zh: 为控制面板自定义 iframe

source: dashboard_iframe.help
fr: Permet d'afficher une iframe sur le dashboard du back-office. Par exemple, les statistiques de visites à l'aide de plausible.io

source: unsplash_client_id
fr: Unsplash API : client ID
zh: Unsplash API : client ID

source: unsplash_client_id.help
fr: Client ID de l'API Unsplash, si vous remplissez un client valide, Roadiz sera en mesure de télécharger des images aléatoires sur la page de login et dans la gestion des Documents.
