Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizTwoFactorBundle/translations/messages.*.xlf
Languages: fr

source: Two-factor authentication
fr: Authentification à deux facteurs

# start_two_factor_activation
source: Start two-factor authentication activation flow
fr: Démarrer l'activation de la double-authentification

# are_you_sure.activate.two_factor
source: Are you sure you want to enable two-factor authentication?
fr: Êtes-vous sûr.e de vouloir activer la double-authentification ?

source: Begin activation
fr: Démarrer l'activation

# scan_qr_code_with_totp_app
source: Scan QRCode with your favorite OTP application
fr: Scannez le QRCode avec votre application OTP préférée

# enter_generated_code_to_finalize
source: Then enter the code generated by your OTP application
fr: Puis, entrez le code généré sur votre application OTP

# submit_totp_code
source: Submit code
fr: Envoyer le code

# twoFactorCode
source: Temporary code
fr: Code temporaire

# twoFactorCode.help
source: Please enter temporary code generated by your OTP application
fr: Veuillez saisir le code temporaire généré par votre application OTP

# invalid_totp_code
source: Invalid OTP code, please try again.
fr: Code invalide, veuillez réessayer.

# two_factor_authentication_is_enabled
source: Two-factor authentication is enabled for your account
fr: La double-authentification est activée pour votre compte

# are_you_sure.disable.two_factor
source: Are you sure you want to disable two-factor authentication?
fr: Êtes-vous sûr.e de vouloir désactiver la double-authentification ?

# disable_two_factor
source: Disable 2FA
fr: Désactiver

source: Disable two-factor authentication
fr: Désactiver la double-authentification

# generate_backup_codes
source: Generate recovery codes
fr: Générer les codes de secours

# two_factor_backup_codes
source: Two-factor authentication recovery codes
fr: Codes de secours de double-authentification

# back_to.two_factor
source: Back to 2FA
fr: Retour à la double-authentification

# request_two_factor_backup_codes
source: Request new recovery codes
fr: Demande de nouveaux codes de secours

# are_you_sure.generate.two_factor_backup_codes.erasing_any_existing
source: Are you sure you want to generate new recovery code? This will erase all existing recovery codes.
fr: Êtes-vous sûr.e de vouloir générer de nouveaux codes de secours ? Cela supprimera tout code de secours existant.

# fill_totp_authentication_code
source: Two-factor authentication
fr: Authentification à deux-facteurs

# totp_code
source: Temporary code
fr: Code temporaire

# store_your_backup_codes
source: Make sure you store your recovery codes in a safe and password-protected place.
fr: Écrivez vos codes de secours dans un endroit sécurisé et protégé par un mot de passe.
