Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/custom-forms/messages.*.xlf
Languages: fr

source: custom-form.usage
fr: Utilisation

source: customForm.retentionTime
fr: Durée de conservation des réponses

source: customForm.retentionTime.help
fr: En définissant une politique de conservation, les réponses seront automatiquements supprimées ainsi que leur données associées. Assurez-vous que les documents attachés ne sont pas utilisés sur votre site.

source: customForm.retentionTime.always
fr: -- Durée illimitée --

source: customForm.retentionTime.one_week
fr: 1 semaine

source: customForm.retentionTime.two_weeks
fr: 2 semaines

source: customForm.retentionTime.one_month
fr: 1 mois

source: customForm.retentionTime.three_months
fr: 3 mois

source: customForm.retentionTime.six_months
fr: 6 mois

source: customForm.retentionTime.one_year
fr: 1 an

source: customForm.retentionTime.two_years
fr: 2 ans

source: customForm.autocomplete
fr: Aide à l'auto-complétion

source: customForm.autocomplete.help
fr: Fournit un indice spécifique aux navigateurs et aides à la saisie sur la valeur à auto-completer pour ce champ.

source: autocomplete.no_autocomplete
fr: -- Non défini --

source: autocomplete.off
fr: Désactiver l'auto-complétion pour ce champ

source: autocomplete.name
fr: Nom complet

source: autocomplete.honorific-prefix
fr: Préfixe ou titre, par exemple « M. », « Mme. », « Me. » , etc

source: autocomplete.honorific-suffix
fr: Suffixe (par exemple "Jr.")

source: autocomplete.given-name
fr: Prénom

source: autocomplete.additional-name
fr: Deuxième prénom

source: autocomplete.family-name
fr: Nom de famille

source: autocomplete.nickname
fr: Surnom

source: autocomplete.email
fr: Adresse email

source: autocomplete.username
fr: Nom de compte ou un nom d'utilisateur

source: autocomplete.organization-title
fr: Titre de poste professionnel

source: autocomplete.organization
fr: Nom d'une entreprise ou d'une organisation

source: autocomplete.street-address
fr: Adresse postale

source: autocomplete.country
fr: Code de pays

source: autocomplete.country-name
fr: Nom de pays

source: autocomplete.postal-code
fr: Code postal

source: autocomplete.bday
fr: Date de naissance complète

source: autocomplete.bday-day
fr: Jour de naissance

source: autocomplete.bday-month
fr: Mois de naissance

source: autocomplete.bday-year
fr: Année de naissance

source: autocomplete.sex
fr: Genre

source: autocomplete.tel
fr: Téléphone (avec indicateur du pays)

source: autocomplete.tel-national
fr: Téléphone (sans indicateur du pays)

source: autocomplete.url
fr: Une URL, pertinente dans le contexte du formulaire

source: autocomplete.photo
fr: URL d'une image représentant l'information de contact
