Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/helps/messages.*.xlf
Languages: fr

# document.private.help
source: Move current document file to a non-public server directory. This option disables document display on your website.
fr: Déplace le fichier dans un dossier du serveur non-accessible publiquement. Cette option désactive l’affichage du document dans votre site.

# document.imageAverageColor.help
source: Image average color, useful to create colored placeholder during image loading on your website.
fr: Couleur moyenne de votre image pour créer des placeholders colorés pendant de le chargement de vos pages.

# node.nodeName.help
source: Node name must be unique and is used to generate your page URL and fetch current node in Themes. It must not contain any special characters.
fr: Le nom du nœud doit être unique et permet de générer les URL de vos pages et de repérer le nœud depuis vos thèmes. Il ne doit contenir aucun caractère spécial.

# node.shadow.help
source: A node marked as a shadow root disappears from your node tree structure and allows you to customize the management of its child nodes.
fr: Un nœud marqué comme racine cachée disparaît de l'arborescence de votre site, et permet de personnaliser la gestion de ses nœuds enfants.

# tag.tagName.help
source: Tag name must be unique and is used to generate your page URL and fetch current tag in Themes. It must not contain any special characters.
fr: Le nom de l’étiquette doit être unique et permet de générer les URL de vos pages et de repérer l’étiquette depuis vos thèmes. Il ne doit contenir aucun caractère spécial.

# tag.locked.help
source: A locked tag is not renamed after updating its translated title. It prevents deletion too.
fr: Une étiquette verrouillée n’est pas renommée lorsque vous modifiez son titre dans la traduction principale. Cela empêche aussi sa suppression.

# folder.locked.help
source: A locked folder is not renamed after updating its translated title. It prevents deletion too.
fr: Un dossier verrouillé n’est pas renommé lorsque vous modifiez son titre dans la traduction principale. Cela empêche aussi sa suppression.

# nodeSource.metaTitle.help
source: SEO title allows you to write the entire title of your page. For optimal display in search engines, the title should not exceed 55 to 65 characters on average.
fr: Le titre de référencement permet de rédiger entièrement le titre de votre page. Pour un affichage optimal dans les moteurs de recherche, le titre ne doit pas dépasser 55 à 65 caractères en moyenne.

# nodeSource.metaDescription.help
source: SEO description is a summary in a few characters of your page. Its purpose is to briefly describe its content. This description must be between 120 and 155 characters long.
fr: La description est un résumé de quelques caractères de votre page. Son objectif est de décrire succinctement son contenu. Cette description doit respecter une taille entre 120 et 155 caractères.

# nodeSource.noIndex.help
source: Prevents robots to index your content and hide them from sitemap.
fr: Indique aux robots de ne pas indexer le contenu et de le cacher du sitemap.

# nodeSource.urlAlias.help
source: URL aliases allow you to rewrite the last part of the URL of your page for each translation. They must be different from the node name and unique throughout your site.
fr: Les alias d’URL permettent de réécrire la dernière partie de l’URL de votre page pour chaque traduction. Ils doivent être différents du nom du nœud et uniques sur tout votre site.

# nodeSource.redirections.help
source: Automatic redirections always redirect visitors from a given request path to the up-to-date current node URL, for this translation. Created redirections will be "permanent" type.
fr: Les redirections automatiques permettent de rediriger la requête saisie vers l'URL actuel du noeud, et pour cette langue en particulier. Les redirections créées sont toujours du type "permanent".

# nodeType.hidingNonReachableNodes.help
source: This node-type will only hide its non-reachable children nodes
fr: Ce type de nœud cachera seulement les nœuds enfant non-accessibles.

# exclude_this_field_from_fulltext_search_engine
source: Exclude this field value from full-text search engine.
fr: Exclut la valeur de ce champ du moteur de recherche plein-texte.

# source_translation.help
source: This will copy node contents from this translation.
fr: Traduction à partir de laquelle tous les contenus seront dupliqués.

# translate_offspring.help
source: This will propagate translation to every node children when they are not translated yet in destination language.
fr: Effectue la traduction sur tous les nœuds enfants en cascade lorsque ceux-ci ne sont pas traduits dans la langue de destination.

# user.publicName.help
source: If filled, public name may be displayed to any other website user, you can use it as a pseudonym.
fr: Si rempli, le nom publique peut être affiché librement sur le site à la manière d'un pseudonyme.

# document.createdAt.help
source: Allows editing Document creation date and time for sorting purposes.
fr: Permet d'éditer la date de création pour modifier le tri des documents.
