Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/webhooks/messages.*.xlf
Languages: es, fr, zh

source: Add a webhook
es: Añadir un webhook
fr: Ajouter un webhook
zh: 添加 webhook

# back_to.webhooks
source: Back to webhooks list
es: Volver a webhooks
fr: Retour à la liste des webhooks
zh: 回到 webhook 列表

# delete.webhook.%name%
source: Delete this webhook
es: Eliminar webhook %name%
fr: Supprimer le webhook
zh: 删除此 webhook

# edit.webhook.%name%
source: Edit this webhook
es: Editar webhook %name%
fr: Éditer le webhook
zh: 编辑此 webhook

# are_you_sure.delete.webhook
source: Are you sure you want to delete this webhook?
es: ¿Estás seguro de querer eliminar este webhook?
fr: Êtes-vous sûr·e de vouloir supprimer ce webhook ?
zh: 您确定要删除此 webhook 吗？

# webhooks.messageType
source: Webhook type
es: Tipo de mensaje del webhook
fr: Type de webhook
zh: Webhook 类型

# webhooks.lastTriggeredAt
source: Last triggered at
fr: Dernier déclenchement
zh: 最后触发于

# webhooks.throttleSeconds
source: Throttling (in seconds)
fr: Temporisation (en secondes)
zh: 节流 (Throttle)（以秒为单位）

# webhooks.rootNode
source: Root node
fr: Nœud racine

# webhooks.rootNode.help
source: Limit webhooks triggers to this root node and its children for every node-related updates.
fr: Limite le déclenchement des webhooks à ce nœud-racine et à sa descendance pour toutes les modifications liée aux nœuds.

source: Never
es: Nunca
fr: Jamais
zh: 从不

# webhook.type.generic_json_post
source: Generic JSON POST
fr: POST JSON générique

# webhook.trigger
source: Trigger webhook
fr: Déclencher le webhook
zh: 触发 webhook

# webhook.%item%.will_be_triggered_in.%seconds%
source: Webhook %item% will be triggered in %seconds% seconds.
fr: Le webhook %item% sera déclenché dans %seconds% secondes.

# are_you_sure.trigger.webhook
source: Are you sure you want to trigger this webhook manually?
fr: Êtes-vous sûr·e de vouloir déclencher manuellement ce webhook ?
zh: 您确定要手动触发此 webhook 吗？

# trigger.webhook.%name%
source: Trigger webhook manually
fr: Déclencher manuellement le webhook
zh: 手动触发 webhook

# webhooks.automatic
source: Automatic trigger
fr: Déclenchement automatique
zh: 自动触发器

# webhooks.automatic.help
source: Webhook will be automatically triggered for each content update (node, tag)
fr: Le webhook sera déclenché à chaque édition d'un contenu (nœud, étiquette)

# webhook.too_many_triggered_in_period
source: Please wait until %time% before triggering this webhook again.
fr: Veuillez patienter jusqu'à %time% avant de déclencher à nouveau ce webhook.
zh: 在再次触发此 webhook 前，请等待至少30秒。

# manage.webhooks
source: Webhooks
es: Andministrar webhooks

# webhooks.uri
source: URI
es: URI del webhook

# webhooks.description
source: Description
es: Descripción del webhook
