Repository: roadiz/core-bundle-dev-app
Catalog: lib/RoadizRozierBundle/translations/realms/messages.*.xlf
Languages: fr

# realms
source: Secure realms
fr: Domaines sécurisés

# add.a.realm
source: Create a secure realm
fr: Créer un domaine sécurisé

# delete.realm.%name%
source: Delete “%name%” realm
fr: Supprimer le domaine “%name%”

# are_you_sure.delete.realm
source: Are you sure you want to delete this secure realm? This will disable every nodes security from this realm.
fr: Êtes-vous sûr.e de vouloir supprimer ce domaine sécurisé ? Cela retirera la sécurité sur tous les nœuds qui font partie de ce domaine.

# edit.realm
source: Edit
fr: Éditer

source: Back to realms
fr: Retour aux domaines

# realm.type
source: Authentication type
fr: Type d'authentification

# realm.type.help
source: Allow choosing between several authentication types: from simple clear password to a more robust and complete authentication scheme using Role or user accounts
fr: Permet de choisir entre plusieurs types d'authentification : du simple mot de passe envoyé en clair à une authentification complète sécurisée par Rôle ou par compte Utilisateur.

# realm.plain_password
source: Clear password
fr: Mot de passe en clair

# realm.bearer_role
source: Role-based authentication
fr: Utilisateur authentifié avec rôle

# realm.bearer_user
source: User-based authentication
fr: Utilisateur spécifique authentifié

# realm.plainPassword
source: Clear password
fr: Mot de passe

# realm.plainPassword.help
source: Clear password will be used against “Clear password” authentication type. It is unique for the whole realm.
fr: Le mot de passe en clair ne sera utilisé qu'avec le type d'authentification « Mot de passe en clair ». Il est unique à tout le domaine.

# realm.serializationGroup
source: Serialization group
fr: Groupe de sérialisation

# realm.serializationGroup.help
source: Each realm provides a serialization group which allows to filter out API fields from nodes or any entities. Use this group when you are creating node types.
fr: Chaque domaine possède un groupe de sérialisation permettant de conditionner l'affichage des champs dans l'API. Utilisez ce groupe lors de la création des types de nœuds.

# realm.role
source: Role
fr: Rôle

# realm.role.help
source: This role will be checked when using “Role-based authentication” authentication type. You can create a new role on-purpose for this realm.
fr: Le rôle sera vérifié seulement avec le type d'authentification « Utilisateur authentifié avec rôle ». Vous pouvez créer un rôle sur mesure pour votre domaine.

# realm.role.placeholder
source: -- No role --
fr: -- Aucun rôle --

# realm.users
source: Specific user accounts
fr: Utilisateurs spécifiques

# realm.users.help
source: Grant access only to specific user accounts. You must select “User-based authentication” authentication type.
fr: Permet de donner accès au domaine pour certains utilisateurs seulement. À utiliser avec le type d'authentification « Utilisateur spécifique authentifié ».

# manage.realms
source: Secure realms
fr: Domaines sécurisés

# edit.node.%name%.realms
source: Secure realms
fr: Domaines sécurisés

# realm_nodes
source: Joined secure realms
fr: Domaines sécurisés rattachés

source: Join a realm
fr: Rejoindre un domaine

# realm_node.realm
source: Secure realm
fr: Domaine sécurisé

# realm_node.realm.help
source: Choose a previously created secure domain to apply to this node and its tree.
fr: Choisissez un domaine sécurisé au préalablement créé pour l'appliquer à ce nœud et à son arborescence.

# realm_node.realm.placeholder
source: -- No realm selected --
fr: -- Aucun domaine sécurisé --

# realm_node.inheritanceType
source: Inheritance type
fr: Type de propagation

# realm_node.inheritanceType.help
source: Define how secure realm will be applied to node hierarchy. Use “Realm root” to start a realm area, or “No propagation” to cancel parent node realm.
fr: Définit la manière dont le domaine sécurise sera propagé aux nœuds enfants. Utilisez le mode « Racine » pour débuter une zone, ou « Aucune propagation » pour annuler le domaine d'un nœud parent.

# realm_node.root
source: Realm root
fr: Racine du domaine

# realm_node.auto
source: Automatic
fr: Automatique

# realm_node.none
source: No propagation
fr: Aucune propagation

# join.realm
source: Join secure realm
fr: Rejoindre le domaine sécurisé

# node.no_realm
source: No realm
fr: Aucun domaine

source: Leave realm
fr: Quitter le domaine

# are_you_sure.leave.realm
source: Are you sure you want to leave this secure realm? All node children with “Automatic” inheritance type will leave this realm too.
fr: Êtes-vous sûr.e de vouloir quitter ce domaine sécurisé ? La suppression sera propagée à tous les nœuds enfants ayant le mode de propagation automatique.

# node.%node%.joined.%realm%
source: Node “%node%” joined “%realm%” realm.
fr: Le nœud “%node%” a rejoint le domaine “%realm%”

# node.%node%.left.%realm%
source: Node “%node%” left “%realm%” realm.
fr: Le nœud “%node%” a quitté le domaine “%realm%”

# realm.behaviour
source: Behaviour on WebResponse
fr: Comportement sur la WebResponse

# realm.behaviour.help
source: Define realm behaviour on WebResponses: API fields conditional serialization applies regardless of the chosen behavior
fr: Définit le comportement du domaine sécurisé sur la WebResponse : la sérialisation conditionnelle des champs s'applique quel que soit le comportement choisi.

# realm.behaviour_none
source: No effect
fr: Aucune incidence

# realm.behaviour_deny
source: Reject requests (error 401)
fr: Rejeter la requête (erreur 401)

# realm.behaviour_hide_blocks
source: Hide blocks
fr: Cacher les blocs
